def process_user_query(query_string):
    lenguages = {
        'Slavic' : 'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя',
        'Armenian' : 'ԱԲԳԴԵԶԷԸԹԺԻԼԽԾԿՀՁՂՃՄՅՆՇՈՉՊՋՌՍՎՏՐՑՒՓՔՕՖ',
        'Georgian' : 'აბგდევზჱთიკლმნჲოპჟრსტჳუფქღყშჩცძწჭხჴჯჰჵჶჷჸ',
        'Latin' : 'ABCDEFGHIJKLMNOPQRSTUVWXYZ',
        'Chinese' : '诶比西迪伊弗吉尺杰开勒马娜哦屁吉吾儿艾丝提伊吾维豆贝尔维克斯吾贼德',
        'Japanese' : 'あいうえおかきくけこがぎぐげごさしすせそざじずぜぞたちつてとだぢづでどなにぬねのはひふへほばびぶべぼぱぴぷぺぽまみむめもやゆよらりるれろわをん',
        'Korean' : 'ㅂㄷㅈㄱㅃㄸㅉㄲㅍㅌㅊㅋㅅㅎㅆㅁㄴㅇㄹㅣㅔㅚㅐㅏㅗㅜㅓㅡㅢㅖㅒㅑㅛㅠㅕㅟㅞㅙㅘㅝ',
        'Cambodian' : 'កខគឃងចឆជឈញដឋឌឍណតថទធនបផពភមយរលវឝឞសហឡអ',
        'Greek' : 'ΑαΒβΓγΔδΕεΖζΗηΘθΙιΚκΛλΜμΝΞξΟοΠπΡρΣΤτΥυΦφΧχΨψΩω',
        'Arabic' : 'غظ ض ذ خ ث ت ش ر ق ص ف ع س ن م ل ك ي ط ح ز و ه د ج ب ا'
    }

    for t in set(query_string.split()):
        for i in t:
            for s in lenguages.values():
                for y in s:
                    if i == y:
                        m = lenguages.keys()
                        m = ' '.join(m)
                        break
                    else:
                        m = 'No lenguage detected'
    return str(m)

#print(process_user_query('В ЮАР Нельсон Мандела также известен как Мадиба (одно из клановых имён народа коса)[26]. Самый пожилой и долгоживущий президент ЮАР: прожил 95 лет (на момент начала президентства — 76 лет, на момент окончания — 81).'))
